app/Controllers/Reservas_controller.php

    public function index(){
        $reservaModel = new Reservas_model();
        $listaReservasDisponibles['reservas'] = $reservaModel->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `reservas`
ORDER BY `id` ASC

            ];

              $reservasModel = new Reservas_model();
              $reservasModel->insert($data);
---
INSERT INTO `reservas` (`nombreReserva`, `descripcionReserva`, `imagen`, `tipo_id`, `precio`, `precio_vta`, `stock`, `stock_min`, `nroHabitacion`) VALUES ('Habitacion de prueba', 'Probando producto', '1687815098_6cd366f95419df136358.jpg', '', '11111', '222', '2', '1', '10')