app/Controllers/ReservaCatalogo_controller.php

SELECT *
FROM `reservas`
WHERE `eliminada` = 'NO'
---
    public function index()
    {
        $reservaModel = new Reservas_model();
        $data['reservas'] = $reservaModel->where('eliminada', 'NO')->findAll();