app/Controllers/Usuario_controller.php

    public function formValidation() {

        $input = $this->validate([
            'nombre'   => 'required|min_length[3]',
            'apellido' => 'required|min_length[3]|max_length[25]',
            'email'    => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
            'usuario'  => 'required|min_length[3]',
            'pass'     => 'required|min_length[3]|max_length[10]'
        ],

       );
        $formModel = new Usuarios_model();

        if (!$input) {
                $data["title"]="Corrientes Plaza Hotel reserva, registrate";
                echo view('front/head',$data);
                echo view('front/navbar');
                //echo view('back/usuario/registrarse', ['validation' => $this->validator]);
                echo view('back/usuario/registro', ['validation' => $this->validator]);
                echo view('front/footer');

        } else {
            $formModel->save([
                'nombre' => $this->request->getVar('nombre'),
                'apellido'=> $this->request->getVar('apellido'),
                'usuario'=> $this->request->getVar('usuario'),
                'email'=> $this->request->getVar('email'),
                'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
              //  password_hash() crea un nuevo hash de contraseña usando un algoritmo de hash de único sentido.
            ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Nahir Siluana', 'Medina', 'siluume', 'siluume@gmail.com', '$2y$10$MPrXj/UgPwR7O7zmiXZcxuRODRkwRxdxfDixJm8Bb3Zi.F0SiTAam')