app/Models/Tipo_reserva_model.php

SELECT *
FROM `tipo_reserva`
---
    public function getTipoReserva(){
        return $this->findAll();